---
kind: enumMember
id: F:Autodesk.Revit.DB.ExternalResourceUIBrowseResultType.Success
enum: Autodesk.Revit.DB.ExternalResourceUIBrowseResultType
source: html/87f3e9ad-042d-6ef8-a1f7-c12ebfcac7d7.htm
---
# Autodesk.Revit.DB.ExternalResourceUIBrowseResultType.Success

There is no predefined error happened during this browse operation. The DB server can store any errors itself in this case.